#Прямоугольный треугольник. 
#Программа запрашивает у пользователя 3 стороны треугольника и определяет, является ли треугольник прямоугольным, 
#используя теорему Пифагора (www-formula.ru) и выводит результат на экран. 
#Также, если треугольник является при этом равнобедренным (т.е. у него равны любые 2 стороны), 
#то дополнительно выводится информация о том, что треугольник еще и равнобедренный. 
#Подсказка: чтобы воспользоваться теоремой Пифагора, нужно сначала найти самую длинную сторону (гипотенуза) и 
#сравнить ее значение в квадрате с суммой квадратов двух остальных сторон. 
#Если все 3 стороны равны, то треугольник равнобедренный и равносторонний, но не прямоугольный.
p "a?"
a = gets.chomp.to_f
p "b?"
b = gets.chomp.to_f
p "c?"
c = gets.chomp.to_f
array = [a, b, c]
max_value = array.max #гипотенуза
#p max_value
array.reject! {|item| item == max_value }
#p array
count_item = array.count

case count_item
when 2 #осталось 2 элемента, сравним их между собой
  max_value_sqrt = max_value * max_value
  a1 = array[0] ** 2
  a2 = array[1] ** 2
  if max_value_sqrt == (a1+a2)
    p "Треугольник прямоугольный"
  end
  if a1 == a2 
    p "Треугольник равнобедренный"
  end
when 1 #2 элемента равны между собой, точно равнобедренный. проверим на прямоугольность
  p "Треугольник равнобедренный"
  max_value_sqrt = max_value ** 2
  max_value_sqrt += max_value_sqrt
  a1 = array[0] ** 2
  if max_value_sqrt == a1
    p "Треугольник прямоугольный"
  end
when 0
  p "треугольник равнобедренный и равносторонний, но не прямоугольный"
end
  

  