class Controller

  def commandList
    p "1.  Завершить работу"
    p "2.  Создать станцию"
    p "3.  Создать поезд"
    p "4.  Создать маршрут"
    p "5.  Добавить станцию в маршрут"
    p "6.  Удалить станцию из маршрута"
    p "7.  Назначить маршрут поезду"
    p "8.  Создать вагон"
    p "9.  Добавить вагон к поезду"
    p "10. Отцепить вагон от поезда"
    p "11. Поехать к следующей станции"
    p "12. Вернуться к предыдущей станции"
    p "13. Просмотреть список станций"
    p "14. Просмотреть список поездов на станции"
    p "15. просмотреть список всех поездов"
    p "16. просмотреть список всех вагонов"
  end
end